@echo off & setlocal enabledelayedexpansion
color A1
TITLE 一键同步路由器时间脚本  --华工路由器正式群出品
set routerPasswd=admin
pushd "%CD%"
CD /D "%~dp0"
echo ◇◇◇◆◇◇◇◇◆◆◇◇◇◇◇◇◇◇◇◇◇◇◆◆◆◇◇◇◇◇
echo ◇◇◇◆◇◇◇◇◇◆◇◇◇◇◇◇◇◆◇◇◇◆◆◆◆◆◇◇◇◇
echo ◇◇◇◆◇◆◆◆◆◆◆◆◆◆◇◇◇◆◆◇◇◆◆◇◆◆◇◇◇◇
echo ◇◆◆◆◆◆◇◆◆◇◆◆◇◇◇◇◇◆◆◇◆◆◆◆◆◆◆◆◆◆
echo ◇◇◆◆◆◇◇◆◆◇◇◆◆◇◇◇◇◇◆◆◆◆◇◇◇◆◇◇◇◇
echo ◇◇◆◆◆◆◆◆◇◇◇◆◆◇◇◇◇◇◆◆◆◆◇◇◇◆◇◇◇◇
echo ◇◇◆◆◆◆◆◆◆◇◇◆◆◆◇◇◇◇◇◇◇◆◆◆◆◆◆◆◆◆
echo ◇◆◆◆◇◆◆◆◆◇◆◆◆◆◇◇◇◇◆◆◇◆◇◇◇◆◇◇◇◇
echo ◇◆◆◆◇◇◇◇◆◆◆◆◇◇◇◇◇◇◆◆◇◆◇◇◇◆◇◇◇◇
echo ◇◆◇◆◇◇◇◇◆◆◆◇◇◇◇◇◇◆◆◇◇◆◆◆◆◆◆◆◆◆
echo ◇◇◇◆◇◇◇◆◆◆◆◆◇◇◇◇◇◆◆◇◇◆◇◇◇◆◇◇◇◇
echo ◇◇◇◆◇◆◆◆◆◇◆◆◆◆◇◇◆◆◇◇◇◆◆◆◆◆◆◆◆◆
echo ◇◇◇◆◇◆◆◇◇◇◇◇◆◆◇◇◇◆◇◇◇◆◇◇◇◇◇◇◇◇
echo.&echo =========================================================
echo 	本脚本由#华工路由器正式群#提供
echo 	注意：登陆路由器密码必须为%routerPasswd%，否则必然失败
echo.&echo =========================================================
echo.
echo 提示：保证路由先能连通再执行脚本
echo 提示：保证路由先能连通再执行脚本
echo 提示：保证路由先能连通再执行脚本
:_PING
echo.
ping -a 192.168.1.1
IF %errorlevel% EQU 0 ( goto _OK ) else ( goto _FAIL )

:_OK
echo 提示：准备在路由执行设置时间脚本
pause
echo y|plink -P 22 -pw %routerPasswd% root@192.168.1.1 "date '%date:~0,4%.%date:~5,2%.%date:~8,2%-%time:~0,8%'"
echo 提示：如果显示时间，说明已经设置好了
pause
exit
:_FAIL 
echo 提示：无法连接路由
pause
exit